<font size="6">MySQL Project in Python3</font>

<font size="3">Import the "mysql-connector" package so that you can use SQL in Python3.</font>

In [28]:
#import package, if it does not work, restart the console and re-run this command.
import mysql.connector

<font size="3">Connect your MySQL server</font>

In [ ]:
#input the credentials
connection = mysql.connector.connect(
    host="0.0.0.0",  # Hostname
    user="user_name",   # Username
    password="pass_Word",  # Password
    database="db_name"  # Database name
)

cursor = connection.cursor()

<font size="6">Table Creation</font>

<font size="3">Please create tables using the ER diagram, define primary keys and foreign keys.</font>

<img src="ER.jpg" alt="Alternative text" />

In [3]:
#create employees table
cursor.execute("""
CREATE TABLE IF NOT EXISTS employees (
    emp_no INT PRIMARY KEY,
    birth_date DATE,
    first_name VARCHAR(14),
    last_name VARCHAR(16),
    sex ENUM ('M', 'F'),
    hire_date DATE
)
""")

In [4]:
#create departments table
cursor.execute("""
CREATE TABLE departments (
    dept_no     CHAR(4)         NOT NULL,
    dept_name   VARCHAR(40)     NOT NULL,
    PRIMARY KEY (dept_no),
    UNIQUE  KEY (dept_name)
)
""")

In [5]:
#create dept_manager table


cursor.execute("""
CREATE TABLE dept_manager (
   emp_no       INT             NOT NULL,
   dept_no      CHAR(4)         NOT NULL,
   from_date    DATE            NOT NULL,
   to_date      DATE            NOT NULL,
   FOREIGN KEY (emp_no)  REFERENCES employees (emp_no)    ON DELETE CASCADE,
   FOREIGN KEY (dept_no) REFERENCES departments (dept_no) ON DELETE CASCADE,
   PRIMARY KEY (emp_no,dept_no)
)
""")

In [9]:
#create dept_emp table
cursor.execute("""
CREATE TABLE IF NOT EXISTS dept_emp (
    emp_no       INT             NOT NULL,
    dept_no      CHAR(4)         NOT NULL,
    from_date    DATE            NOT NULL,
    to_date      DATE            NOT NULL,
    FOREIGN KEY (emp_no)  REFERENCES employees (emp_no)    ON DELETE CASCADE,
    FOREIGN KEY (dept_no) REFERENCES departments (dept_no) ON DELETE CASCADE,
    PRIMARY KEY (emp_no,dept_no)
)
""")

In [3]:
#create title table PRIMARY KEY SHOULD BE (emp_no,title,from_date)
cursor.execute("""
CREATE TABLE IF NOT EXISTS title (
     emp_no       INT             NOT NULL,
     title   VARCHAR(100)     NOT NULL,
     from_date    DATE            NOT NULL,
     to_date      DATE            NOT NULL,
     FOREIGN KEY (emp_no)  REFERENCES employees (emp_no)    ON DELETE CASCADE,
     PRIMARY KEY (emp_no,title,from_date,to_date)
)
""")

<font size="6">Insert Data</font>

<font size="3">Congrats on table creation. Please populate data into the tables.</font>

In [4]:
#import csv module
import csv

In [12]:
#populate data to employee table, it may take around a minute
with open('load_employees.csv', 'r') as f:
    csv_reader = csv.reader(f)
    for row in csv_reader:
        cursor.execute("INSERT INTO employees (emp_no, birth_date, first_name, last_name, sex, hire_date) VALUES (%s, %s, %s, %s, %s, %s)", row)

# Commit changes
connection.commit()

<font size="3">Do a simple select query on employee to check whether the data has been populated.</font>

In [13]:
#simple test of 5 records
cursor.execute("SELECT * FROM employees LIMIT 5;")
records = cursor.fetchall()
for record in records:
    print(record)

(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26))
(10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21))
(10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28))
(10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1))
(10005, datetime.date(1955, 1, 21), 'Kyoichi', 'Maliniak', 'M', datetime.date(1989, 9, 12))

In [14]:
#populate data to the departments, it may take a while
with open('load_departments.csv', 'r') as f:
    csv_reader = csv.reader(f)
    for row in csv_reader:
        cursor.execute("INSERT INTO departments (dept_no, dept_name) VALUES (%s, %s)", row)

# Commit changes
connection.commit()

In [15]:
#populate data to dept_manager
with open('load_dept_manager.csv', 'r') as f:
    csv_reader = csv.reader(f)
    for row in csv_reader:
        cursor.execute("INSERT INTO dept_manager (emp_no, dept_no, from_date, to_date) VALUES (%s, %s, %s, %s)", row)

# Commit changes
connection.commit()

In [16]:
#populate data to the dept_emp, it may take a while
with open('load_dept_emp.csv', 'r') as f:
    csv_reader = csv.reader(f)
    for row in csv_reader:
        cursor.execute("INSERT INTO dept_emp (emp_no, dept_no, from_date, to_date) VALUES (%s, %s, %s, %s)", row)

# Commit changes
connection.commit()

In [5]:
#populate data to the last title, it may take a while
with open('load_titles.csv', 'r') as f:
    csv_reader = csv.reader(f)
    for row in csv_reader:
        cursor.execute("INSERT INTO title (emp_no, title, from_date, to_date) VALUES (%s, %s, %s, %s)", row)

# Commit changes
connection.commit()

<font size="6">SQL practice</font>

In [8]:
# Select the top 5 employees with the highest `emp_no`
cursor.execute("""
SELECT * FROM employees
ORDER BY emp_no DESC
LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

(499999, datetime.date(1958, 5, 1), 'Sachin', 'Tsukuda', 'M', datetime.date(1997, 11, 30))
(499998, datetime.date(1956, 9, 5), 'Patricia', 'Breugel', 'M', datetime.date(1993, 10, 13))
(499997, datetime.date(1961, 8, 3), 'Berhard', 'Lenart', 'M', datetime.date(1986, 4, 21))
(499996, datetime.date(1953, 3, 7), 'Zito', 'Baaz', 'M', datetime.date(1990, 9, 27))
(499995, datetime.date(1958, 9, 24), 'Dekang', 'Lichtner', 'F', datetime.date(1993, 1, 12))

In [9]:
# Find how many distinct `hire_date` values from the employees table.
cursor.execute("""
SELECT COUNT(DISTINCT hire_date) FROM employees;
""")

records = cursor.fetchall()
for record in records:
    print(record)

(5434,)

In [10]:
# Use a literal string to add a column indicating the employee type as Full time and display 5 records
cursor.execute("""

SELECT *, 'Full time' AS employee_type
FROM employees

LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 'Full time')
(10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21), 'Full time')
(10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28), 'Full time')
(10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1), 'Full time')
(10005, datetime.date(1955, 1, 21), 'Kyoichi', 'Maliniak', 'M', datetime.date(1989, 9, 12), 'Full time')

In [12]:
# Find all employees hired after '1999-01-01' display 5 records.
cursor.execute("""
SELECT *
FROM employees
WHERE hire_date > '1999-01-01'
Limit 5;""")
records = cursor.fetchall()
for record in records:
    print(record)

(10019, datetime.date(1953, 1, 23), 'Lillian', 'Haddadi', 'M', datetime.date(1999, 4, 30))
(10105, datetime.date(1962, 2, 5), 'Hironoby', 'Piveteau', 'M', datetime.date(1999, 3, 23))
(10298, datetime.date(1954, 7, 6), 'Dietrich', 'DuCasse', 'F', datetime.date(1999, 3, 30))
(10684, datetime.date(1956, 1, 23), 'Aimee', 'Tokunaga', 'F', datetime.date(1999, 10, 28))
(11315, datetime.date(1955, 4, 21), 'Neven', 'Meriste', 'M', datetime.date(1999, 7, 17))

In [13]:
# Perform a Cartesian product on `departments` and `dept_manager` and display 5 records.
cursor.execute("""
SELECT *
FROM departments
CROSS JOIN dept_manager
LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

('d009', 'Customer Service', 110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1))
('d005', 'Development', 110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1))
('d002', 'Finance', 110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1))
('d003', 'Human Resources', 110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1))
('d001', 'Marketing', 110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1))

In [14]:
#  Find 5 pairs of employees with the same `last_name`.
cursor.execute("""
SELECT e1.emp_no, e1.first_name, e1.last_name, e2.emp_no, e2.first_name
FROM employees e1
JOIN employees e2 ON e1.last_name = e2.last_name AND e1.emp_no < e2.emp_no
LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

(10001, 'Georgi', 'Facello', 10327, 'Roded')
(10001, 'Georgi', 'Facello', 12751, 'Nahum')
(10001, 'Georgi', 'Facello', 15346, 'Kirk')
(10001, 'Georgi', 'Facello', 15685, 'Kasturi')
(10001, 'Georgi', 'Facello', 18686, 'Kwangyoen')

In [16]:
#  Concatenate `first_name` and `last_name` columns display 5 records.
cursor.execute("""
SELECT CONCAT(first_name, " ", last_name) AS full_name
FROM employees
LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

('Georgi Facello',)
('Bezalel Simmel',)
('Parto Bamford',)
('Chirstian Koblick',)
('Kyoichi Maliniak',)

In [18]:
#  Order employees by `last_name` in ascending order and `first_name` in descending order, display 5 records.

cursor.execute("""
SELECT *
FROM employees
ORDER BY last_name ASC, first_name DESC
LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

(40184, datetime.date(1962, 2, 27), 'Zvonko', 'Aamodt', 'F', datetime.date(1991, 4, 29))
(83170, datetime.date(1956, 9, 17), 'Ziya', 'Aamodt', 'M', datetime.date(1990, 1, 4))
(239949, datetime.date(1962, 8, 21), 'Zhiwei', 'Aamodt', 'F', datetime.date(1990, 11, 26))
(100010, datetime.date(1959, 11, 6), 'Youpyo', 'Aamodt', 'M', datetime.date(1991, 10, 4))
(105323, datetime.date(1953, 2, 15), 'Younwoo', 'Aamodt', 'F', datetime.date(1992, 2, 28))

In [20]:
#  Find employees whose `first_name` is either 'Mary' or 'John'.

cursor.execute("""
SELECT *
FROM employees
WHERE first_name IN ('Mary', 'John')
LIMIT 5;""")
records = cursor.fetchall()
for record in records:
    print(record)

(10011, datetime.date(1953, 11, 7), 'Mary', 'Sluis', 'F', datetime.date(1990, 1, 22))
(10532, datetime.date(1959, 8, 31), 'Mary', 'Wossner', 'F', datetime.date(1986, 5, 18))
(11821, datetime.date(1954, 10, 18), 'Mary', 'Piazza', 'F', datetime.date(1995, 12, 13))
(12334, datetime.date(1962, 3, 8), 'Mary', 'Ertl', 'F', datetime.date(1990, 3, 6))
(13562, datetime.date(1960, 2, 15), 'Mary', 'Cooley', 'M', datetime.date(1986, 2, 24))

In [21]:
#  Group by `first_name` and filter groups having more than 10 employees

cursor.execute("""
SELECT first_name, COUNT(*) AS employee_count
FROM employees
GROUP BY first_name
HAVING COUNT(*) > 10
LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

('Aamer', 228)
('Aamod', 216)
('Abdelaziz', 227)
('Abdelghani', 247)
('Abdelkader', 222)

In [22]:
#  Use a subquery to find all employees who are also managers

cursor.execute("""
SELECT *
FROM employees
WHERE emp_no IN (
    SELECT emp_no
    FROM dept_manager
)
LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

(110022, datetime.date(1956, 9, 12), 'Margareta', 'Markovitch', 'M', datetime.date(1985, 1, 1))
(110039, datetime.date(1963, 6, 21), 'Vishwani', 'Minakawa', 'M', datetime.date(1986, 4, 12))
(110085, datetime.date(1959, 10, 28), 'Ebru', 'Alpin', 'M', datetime.date(1985, 1, 1))
(110114, datetime.date(1957, 3, 28), 'Isamu', 'Legleitner', 'F', datetime.date(1985, 1, 14))
(110183, datetime.date(1953, 6, 24), 'Shirish', 'Ossenbruggen', 'F', datetime.date(1985, 1, 1))

In [23]:
#  Find employees whose `emp_no` is greater than some `emp_no` in `dept_manager`.


cursor.execute("""

SELECT *
FROM employees
WHERE emp_no > ANY (
    SELECT emp_no
    FROM dept_manager
)

LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

(110039, datetime.date(1963, 6, 21), 'Vishwani', 'Minakawa', 'M', datetime.date(1986, 4, 12))
(110085, datetime.date(1959, 10, 28), 'Ebru', 'Alpin', 'M', datetime.date(1985, 1, 1))
(110114, datetime.date(1957, 3, 28), 'Isamu', 'Legleitner', 'F', datetime.date(1985, 1, 14))
(110183, datetime.date(1953, 6, 24), 'Shirish', 'Ossenbruggen', 'F', datetime.date(1985, 1, 1))
(110228, datetime.date(1958, 12, 2), 'Karsten', 'Sigstam', 'F', datetime.date(1985, 8, 4))

In [25]:
#  Use a subquery to check if there are any rows in `dept_manager` where `from_date` is after '2000-01-01'


cursor.execute("""
SELECT EXISTS (
    SELECT 1
    FROM dept_manager
    WHERE from_date > '2000-01-01'
) AS has_recent_from_date;

LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

(0,)

In [30]:
#  Find employees who are managers using EXISTS clause.

cursor.execute("""

SELECT *
FROM employees e
WHERE EXISTS (
    SELECT 1
    FROM dept_manager dm
    WHERE dm.emp_no = e.emp_no
)

LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

(110022, datetime.date(1956, 9, 12), 'Margareta', 'Markovitch', 'M', datetime.date(1985, 1, 1))
(110039, datetime.date(1963, 6, 21), 'Vishwani', 'Minakawa', 'M', datetime.date(1986, 4, 12))
(110085, datetime.date(1959, 10, 28), 'Ebru', 'Alpin', 'M', datetime.date(1985, 1, 1))
(110114, datetime.date(1957, 3, 28), 'Isamu', 'Legleitner', 'F', datetime.date(1985, 1, 14))
(110183, datetime.date(1953, 6, 24), 'Shirish', 'Ossenbruggen', 'F', datetime.date(1985, 1, 1))

In [31]:
#  Use a scalar subquery to find the `last_name` of the employee with the highest `emp_no`.

cursor.execute("""
SELECT last_name
FROM employees
WHERE emp_no = (SELECT MAX(emp_no) FROM employees);
""")

records = cursor.fetchall()
for record in records:
    print(record)

('Tsukuda',)

In [32]:
#  Find the average, minimum, and maximum age of employees. YEAR(CURDATE()ï¼‰is the command for current year

cursor.execute("""

SELECT 
    AVG(YEAR(CURDATE()) - YEAR(birth_date)) AS average_age,
    MIN(YEAR(CURDATE()) - YEAR(birth_date)) AS minimum_age,
    MAX(YEAR(CURDATE()) - YEAR(birth_date)) AS maximum_age
FROM employees;

""")

records = cursor.fetchall()
for record in records:
    print(record)

(Decimal('65.9181'), 59, 72)

In [33]:
#  Group by `first_name` and filter groups having more than 10 employees who have been hired for more than 15 years.

cursor.execute("""

SELECT first_name, COUNT(*) AS employee_count
FROM employees
WHERE YEAR(CURDATE()) - YEAR(hire_date) > 15
GROUP BY first_name
HAVING COUNT(*) > 10

LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

('Aamer', 228)
('Aamod', 216)
('Abdelaziz', 227)
('Abdelghani', 247)
('Abdelkader', 222)

In [34]:
#  Find employees whose age is above the average age.

cursor.execute("""

SELECT *
FROM employees
WHERE (YEAR(CURDATE()) - YEAR(birth_date)) > (
    SELECT AVG(YEAR(CURDATE()) - YEAR(birth_date))
    FROM employees
)

LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26))
(10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1))
(10005, datetime.date(1955, 1, 21), 'Kyoichi', 'Maliniak', 'M', datetime.date(1989, 9, 12))
(10006, datetime.date(1953, 4, 20), 'Anneke', 'Preusig', 'F', datetime.date(1989, 6, 2))
(10007, datetime.date(1957, 5, 23), 'Tzvetan', 'Zielinski', 'F', datetime.date(1989, 2, 10))

In [36]:
#  List the first name, last name, and department name of all employees.

cursor.execute("""
SELECT e.first_name, e.last_name, d.dept_name
FROM departments d
LEFT JOIN dept_emp de ON d.dept_no = de.dept_no
LEFT JOIN employees e ON de.emp_no = e.emp_no
LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

('Mary', 'Sluis', 'Customer Service')
('Huan', 'Lortz', 'Customer Service')
('Basil', 'Tramer', 'Customer Service')
('Breannda', 'Billingsley', 'Customer Service')
('Jungsoon', 'Syrzycki', 'Customer Service')

In [37]:
#  List all employees and the names of the department they work in, including those without a department.

cursor.execute("""
SELECT e.first_name, e.last_name, d.dept_name
FROM employees e
LEFT JOIN dept_emp de ON e.emp_no = de.emp_no
LEFT JOIN departments d ON de.dept_no = d.dept_no
LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

('Georgi', 'Facello', 'Development')
('Bezalel', 'Simmel', 'Sales')
('Parto', 'Bamford', 'Production')
('Chirstian', 'Koblick', 'Production')
('Kyoichi', 'Maliniak', 'Human Resources')

In [39]:
#  List all departments and the names of the employees who work in them, including departments without employees.

cursor.execute("""

SELECT e.first_name, e.last_name, d.dept_name
FROM departments d
LEFT JOIN dept_emp de ON d.dept_no = de.dept_no
LEFT JOIN employees e ON de.emp_no = e.emp_no


LIMIT 5;""")

records = cursor.fetchall()
for record in records:
    print(record)

('Mary', 'Sluis', 'Customer Service')
('Huan', 'Lortz', 'Customer Service')
('Basil', 'Tramer', 'Customer Service')
('Breannda', 'Billingsley', 'Customer Service')
('Jungsoon', 'Syrzycki', 'Customer Service')

In [43]:
#  Find the department with the maximum average age of employees.

cursor.execute("""
SELECT d.dept_name, AVG(YEAR(CURDATE()) - YEAR(e.birth_date)) AS average_age
FROM employees e
JOIN dept_emp de ON e.emp_no = de.emp_no
JOIN departments d ON de.dept_no = d.dept_no
GROUP BY d.dept_name
ORDER BY average_age DESC
LIMIT 1;

""")

records = cursor.fetchall()
for record in records:
    print(record)

('Human Resources', Decimal('65.9490'))

In [45]:
#  List the managers IDs and departments who have been working for more than 15 years in their department and have at least one employee in their department older than them.

cursor.execute("""


SELECT dm.emp_no, d.dept_name
FROM dept_manager dm
JOIN departments d ON dm.dept_no = d.dept_no
JOIN employees m ON dm.emp_no = m.emp_no
JOIN dept_emp de ON dm.dept_no = de.dept_no
JOIN employees e ON de.emp_no = e.emp_no
WHERE (YEAR(CURDATE()) - YEAR(dm.from_date)) > 15
AND (YEAR(CURDATE()) - YEAR(e.birth_date)) > (YEAR(CURDATE()) - YEAR(m.birth_date))

LIMIT 5;""")



records = cursor.fetchall()
for record in records:
    print(record)

(111692, 'Customer Service')
(111692, 'Customer Service')
(111692, 'Customer Service')
(111692, 'Customer Service')
(111692, 'Customer Service')

<font size="3">Close the cursor and shutdown the connenction</font>

In [46]:
cursor.close()
connection.close()
print("MySQL connection is closed")

MySQL connection is closed